Revit 2027 API
IntersectionResultArray.Insert Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Insert(
	IntersectionResult item,
	int index
)
Public Overridable Sub Insert (
	item As IntersectionResult,
	index As Integer
)
public:
virtual void Insert(
	IntersectionResult^ item,
	int index
)
abstract Insert :
        item : IntersectionResult *
        index : int -> unit
override Insert :
        item : IntersectionResult *
        index : int -> unit
Parameters
item IntersectionResult
index Int32
See Also
Reference
IntersectionResultArray Class
Autodesk.Revit.DB Namespace